Revit 2024 API
OverrideGraphicSettings.SetCutBackgroundPatternVisible Method
 Sets the visibility of the cut face background fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public OverrideGraphicSettings SetCutBackgroundPatternVisible(
	bool fillPatternVisible
)
Visual Basic
Public Function SetCutBackgroundPatternVisible ( _
	fillPatternVisible As Boolean _
) As OverrideGraphicSettings
Visual C++
public:
OverrideGraphicSettings^ SetCutBackgroundPatternVisible(
	bool fillPatternVisible
)
Parameters
fillPatternVisible
Type: System.Boolean
 Value of the visibility of the cut face background fill pattern.
Return Value
 Reference to the changed object.
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace